; domain
(define (domain blockWorld)
  (:requirements :strips :typing)
  (:types block)
  (:predicates
    (on ?x - block ?y - block)
    (ontable ?x - block)
    (clear ?x - block)
    (handempty)
    (holding ?x - block))
  (:action pick-up
    ;;; action qui ramasse un bloc pose sur la table
    :parameters (?x - block)
    :precondition (and (clear ?x) (ontable ?x) (handempty))
    :effect (and (not (ontable ?x))
            (not (clear ?x))
            (not (handempty))
            (holding ?x)))
  (:action unstack
    ;;; action qui ramasse un bloc pose sur un autre
    :parameters (?x - block ?y - block)
    :precondition (and (clear ?x) (on ?x ?y) (handempty))
    :effect (and (not (on ?x ?y))
            (not (clear ?x))
            (not (handempty))
            (holding ?x)
            (clear ?y)))
  (:action put-down
    ;;; action qui pose un bloc sur la table
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and (not (holding ?x))
            (clear ?x)
            (handempty)
            (ontable ?x)))
  (:action stack
    ;;; action qui pose un bloc sur un autre
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty)
            (on ?x ?y))))

; problem
(define (problem blockProblem)
  (:domain blockWorld)
  (:objects A B C D E F - block)
  (:init (ontable A)
         (on B A)
         (on C B)
         (on D C)
         (on E D)
         (on F E)
         (clear F)
         (handempty))
  (:goal (and (ontable F)
         (on A B) 
         (on B C) 
         (on C D)
         (on D E)
         (on E F)
         (clear A) 
         (handempty))))

; plan
1. (unstack f e)
   deleted: (on f e) (clear f) (handempty)
   added: (holding f) (clear e)
   goals met: 0 of 8
2. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 2 of 8
3. (unstack e d)
   deleted: (on e d) (clear e) (handempty)
   added: (holding e) (clear d)
   goals met: 1 of 8
4. (stack e f)
   deleted: (holding e) (clear f)
   added: (clear e) (handempty) (on e f)
   goals met: 3 of 8
5. (unstack d c)
   deleted: (on d c) (clear d) (handempty)
   added: (holding d) (clear c)
   goals met: 2 of 8
6. (stack d e)
   deleted: (holding d) (clear e)
   added: (clear d) (handempty) (on d e)
   goals met: 4 of 8
7. (unstack c b)
   deleted: (on c b) (clear c) (handempty)
   added: (holding c) (clear b)
   goals met: 3 of 8
8. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 5 of 8
9. (unstack b a)
   deleted: (on b a) (clear b) (handempty)
   added: (holding b) (clear a)
   goals met: 5 of 8
10. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (handempty) (on b c)
   goals met: 7 of 8
11. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 5 of 8
12. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 8 of 8
